# 21. Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1


spisok = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
n = "qwe"

#spisok = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
#n = 'йцу'

#spisok = ["йцу", "фыв", "ячс", "цук", "йцукен"]
#n = "йцу"

#spisok = ["123", "234", '321', "567"]
#n = "123"

#spisok = []
#n = '123'

print(f'ищем {n} в этом списке: ')
print (f'Cписок: {spisok}')

count = 0 
position2 = -1
for i in range( 0, len(spisok) ):
    if str(n) in spisok[i]:
        count = count + 1
        if count == 2: 
            position2 = i
            print(f'позиция второго вхождения {n}: {position2}')
            break

if count == 1: print(f'нет второго вхождения {n}: в список')
if count == 0: print(f'нет вхождений {n}: в список')
